{"keras_version": "1.1.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>B\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": [160, 320, 3], "batch_input_shape": [null, 160, 320, 3], "arguments": {}, "input_dtype": "float32", "trainable": true, "name": "lambda_1", "output_shape_type": "raw", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 16, "border_mode": "same", "b_constraint": null, "b_regularizer": null, "W_regularizer": {"name": "WeightRegularizer", "l1": 0.0, "l2": 0.0}, "bias": true, "activation": "linear", "subsample": [4, 4], "trainable": true, "W_constraint": null, "name": "convolution2d_1", "nb_row": 8, "nb_col": 8}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 32, "border_mode": "same", "b_constraint": null, "b_regularizer": null, "W_regularizer": {"name": "WeightRegularizer", "l1": 0.0, "l2": 0.0}, "bias": true, "activation": "linear", "subsample": [2, 2], "trainable": true, "W_constraint": null, "name": "convolution2d_2", "nb_row": 5, "nb_col": 5}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 64, "border_mode": "same", "b_constraint": null, "b_regularizer": null, "W_regularizer": {"name": "WeightRegularizer", "l1": 0.0, "l2": 0.0}, "bias": true, "activation": "linear", "subsample": [2, 2], "trainable": true, "W_constraint": null, "name": "convolution2d_3", "nb_row": 5, "nb_col": 5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "bias": true, "activation": "linear", "W_regularizer": {"name": "WeightRegularizer", "l1": 0.0, "l2": 0.0}, "trainable": true, "name": "dense_1", "output_dim": 512, "input_dim": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "bias": true, "activation": "linear", "W_regularizer": {"name": "WeightRegularizer", "l1": 0.0, "l2": 0.0}, "trainable": true, "name": "dense_2", "output_dim": 1, "input_dim": null}}]}